/********************************************************************************************************************************

███████╗██╗  ██╗ █████╗  ██████╗ ██╗  ██╗    ██████╗██╗  ██╗    ██╗  ██╗██╗████████╗ ██████╗ ██╗  ██╗ ██████╗ ████████╗ ██████╗
╚══███╔╝██║  ██║██╔══██╗██╔═══██╗╚██╗██╔╝   ██╔════╝██║  ██║    ██║  ██║██║╚══██╔══╝██╔═══██╗██║ ██╔╝██╔═══██╗╚══██╔══╝██╔═══██╗
  ███╔╝ ███████║███████║██║   ██║ ╚███╔╝    ██║     ███████║    ███████║██║   ██║   ██║   ██║█████╔╝ ██║   ██║   ██║   ██║   ██║
 ███╔╝  ██╔══██║██╔══██║██║   ██║ ██╔██╗    ██║     ██╔══██║    ██╔══██║██║   ██║   ██║   ██║██╔═██╗ ██║   ██║   ██║   ██║   ██║
███████╗██║  ██║██║  ██║╚██████╔╝██╔╝ ██╗██╗╚██████╗██║  ██║    ██║  ██║██║   ██║   ╚██████╔╝██║  ██╗╚██████╔╝   ██║   ╚██████╔╝
╚══════╝╚═╝  ╚═╝╚═╝  ╚═╝ ╚═════╝ ╚═╝  ╚═╝╚═╝ ╚═════╝╚═╝  ╚═╝    ╚═╝  ╚═╝╚═╝   ╚═╝    ╚═════╝ ╚═╝  ╚═╝ ╚═════╝    ╚═╝    ╚═════╝

*********************************************************************************************************************************/

/** hitokoto **/

function generate_hitokoto() {

  /* hitokotos for desktop */
  let hitokotos_large = [
    '死生契闊，與子成說，執子之手，與子偕老',
    '橫看成嶺側成峰，遠近高低各不同',
    '落其實者思其樹，飲其流者懷其源',
    '春蠶到死絲方盡，蠟炬成灰淚始干',
    '人生得意須盡歡，莫使金樽空對月',
    '路漫漫其修遠兮，吾將上下而求索',
    '君看一葉舟，出沒風波里',
    '高山仰止，景行行止',
    '不以物喜，不以己悲'
  ];

  /* hitokotos for mobile */
  let hitokotos_small = [
    '(ﾟ∀ﾟ)',
    '( • ̀ω•́ )',
    '(*´▽`*)',
    '(ﾉ∀`*)',
    '(^u^)'
  ];

  let hitokoto = document.getElementById('hitokoto');
  let text_gen = function (hitokotos) {return hitokotos[Math.floor(Math.random() * hitokotos.length)];}
  let size_gen = function (percentage, text) {return (percentage / text.length) + 'vw';}

  /* check screen */
  if (window.screen.width < 768) {
    let text = text_gen(hitokotos_small);
    hitokoto.innerText = text;
    hitokoto.style.fontSize = size_gen(100, text);
  } else {
    let text = text_gen(hitokotos_large);
    text = "「" + text + "」";
    hitokoto.innerText = text;
    hitokoto.style.fontSize = size_gen(85, text);
  }

}
